aa8764114/nRF5_SDK_15.3.0_59ac345/components/ssm_boards/ss2sw.c
#include "ss2sw.h"
#include "app_timer.h"
#include "nrf_drv_gpiote.h"
#include "misc.h"
#include "nrf_atomic.h"
#include "nrf_saadc.h"
#include "nrf_rtc.h"
#include "nrf_delay.h"
#include "nrfx_ppi.h"
#include "bsp.h"



#define NRF_LOG_MODULE_NAME     HW_SS2SW
#define NRF_LOG_LEVEL           NRF_LOG_SEVERITY_INFO
#define ACTSEQ_STATE_SWITCH_100_MS 100

#define POLLING_INTERVAL_10MS_START 10
#define POLLING_INTERVAL_DEBOUNCE   10
#define POLLING_INTERVAL_STABLE     100
#define MSW_GPIO_DEBOUNCE_TIME      50

#define DRV_nSLEEP_PIN  16
#define DRV_PH_PIN      15
#define DRV_EN_PIN      14

#define GPIO_MICRO_SWITCH_SENSOR 4
#define MICRO_SWITCH_DEBOUNCE_MS 100


#define CALIB_INTERVAL_MS               (3 * 60 * 1000)    // 3 minutes (5 min doesn't work w/ APP_TIMER_V2 & default 300 sec APP_TIMER_SAFE_WINDOW_MS)
#define CALIB_TEMPERATURE_CRITIRIA      (4)         // 1 degree

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();
#include "nrf_log_ctrl.h"

#define RTC_ID                          2
#define RTC_REG                         NRFX_CONCAT_2(NRF_RTC, RTC_ID)
#define RTC_IRQ                         NRFX_CONCAT_3(RTC, RTC_ID, _IRQn)
#define RTC_CH_COUNT                    NRF_RTC_CC_CHANNEL_COUNT(RTC_ID)
#define RTC_IRQHandler                  NRFX_CONCAT_3(RTC, RTC_ID, _IRQHandler)
#define RTC_PRESCALER                   (0)
#define THREE_MINUTE_RTC_MS             (32768 * 3 * 60)    // 3 minutes
//#define THREE_MINUTE_RTC_MS             (32768 * 20)    // 20 second  for debug

#define BATTERY_ADC_NOISE               (3)


#define SAADC_INT_PRIORITY              APP_IRQ_PRIORITY_HIGHEST
#define SAADC_CHANNEL_BATTERY           (0)
#define SAADC_EXPECTED_NOISE            (4)

//#define EVENT_INT_PRIORITY              APP_IRQ_PRIORITY_LOW
//#define EVENT_IRQn                      SWI0_EGU4_IRQn          // according to SDS, it's available for application use
//#define EVENT_IRQ_HANDLER               SWI0_EGU4_IRQHandler
#define EVENT_HANDLER                   ss2sw_event_handler
#define EVENT_BUFFER_CNT                (4)
STATIC_ASSERT(IS_POWER_OF_TWO(EVENT_BUFFER_CNT));
//static ss2sw_event_t event_buffer[EVENT_BUFFER_CNT];
static nrf_atomic_u32_t event_buffer_idx;

static ss2sw_event_t event = {0};


typedef struct calibration_s
{
    uint32_t    last_calibration_time;
    int32_t     last_calibration_temperature;
} calibration_t;

typedef struct battery_s
{
    int16_t     adc;
    uint32_t    last_time;
} battery_t;

typedef enum
{
    SAADC_CONFIGURATION_NONE,
    SAADC_CONFIGURATION_POSITION_ONLY,
    SAADC_CONFIGURATION_POSITION_AND_BATTERY,
} saadc_configuration_e;

static bool is_configured;
//static bool need_battery;
static bool need_calibrate;
static calibration_t calib;
static battery_t battery;

static ss2sw_conf_t conf;
static nrf_ppi_channel_t ppi_ch_on_rtc_adc;
static nrf_ppi_channel_t ppi_ch_on_adc_calib;

static nrf_saadc_value_t saadc_buffer[1];
//static nrf_saadc_channel_config_t adc_conf_battery;
//static saadc_configuration_e saadc_configuration;



APP_TIMER_DEF(act_seq_timer_id);
APP_TIMER_DEF(calib_timer);
APP_TIMER_DEF(msw_gpio_polling_state_timer);
//APP_TIMER_DEF(mswitch_debounce_timer);

micro_switch_gpio_polling_state_ msw_gpio_polling_state = INTI_MSW_GPIO_DETECT_;
uint8_t msw_gpio_stable;
uint8_t msw_gpio_debounce;
uint16_t msw_gpio_nochg_dur_debounce;
uint16_t msw_gpio_polling_interval;

actseq_state_t actseq_state = ACTSEQ_INIT_;
bool actseq_exec = false;

motor_single_act  cur_act_seq[MAX_ACTS_SEQCMD];
//motor_single_act  *cur_act_type;
void        *cur_act_type;
bool        manual_operation = false;
uint16_t    cur_exec_iteration_max = 0; 
uint16_t    cur_exec_iteration_done = 0; 
uint16_t    cur_exec_loop_done = 0; 
uint16_t    idx_cur_act_seq;

bool        pos_act_req = false;
bool        manual_op_req = false;
bool        exec_ble_unlock_cmd_req = false;
bool        batt_adc_update_req = false;
bool        switch_sensor_update_req = false;

uint16_t    actseq_req = 0;
uint16_t    actseq_done = 0;

uint16_t    break_cmd_req =0;
uint16_t    break_cmd_done =0;

motor_single_act poweron_motor_init_seq[] = { {COAST_,    0     }, 
                                              {END_ACT_SEQ_,0}
                                            };

motor_single_act standard_press_release_seq[] =
                                            { {FORWARD_,  1000  }, 
                                              {BRAKE_,    200   }, 
                                              {REVERSE_,  1000  },
                                              {COAST_,    0     }, 
                                              {END_ACT_SEQ_,0}
                                            };

motor_single_act arm_positioning_release_seq[] =
                                            { {FORWARD_,  2000  }, 
                                              {BRAKE_,    1000   }, 
                                              {REVERSE_,  800  },
                                              {COAST_,    0     }, 
                                              {END_ACT_SEQ_,0}
                                            };

const ss2sw_conf_t sw_mech_setting_default = {
                                              .unlock_drvieF_time = 10,   // 10, one second
                                              .unlock_drvieH_time = 2,    //  2, 0.2 second
                                              .unlock_drvieB_time = 10,   // 10, one second
                                              .padding_onebyte0 = 0,
                                              .padding_twobyte1 = 0,
                                              .padding_twobyte2 = 0,
                                              .padding_twobyte3 = 0,
                                              .padding_twobyte4 = 0,
                                              };

void ss2sw_event_handler(ss2sw_event_t const * event);

void positioning_act_request(void)
{   

    CRITICAL_REGION_ENTER();
    pos_act_req = true;
    CRITICAL_REGION_EXIT();
}

