aa8764114/nRF5_SDK_15.3.0_59ac345/components/ssm_boards/ss2sw.c
bool need_to_positioning_act(void)
{   
    bool ret_val = true;
    CRITICAL_REGION_ENTER();
    ret_val = pos_act_req;
    CRITICAL_REGION_EXIT();
    return ret_val;
}

void positioning_act_done(void)
{
    CRITICAL_REGION_ENTER();
    pos_act_req = false;
    CRITICAL_REGION_EXIT();
}

void manualop_act_request(void)
{   

    CRITICAL_REGION_ENTER();
    manual_op_req = true;
    CRITICAL_REGION_EXIT();
}

bool need_to_manualop_act(void)
{   
    bool ret_val = true;
    CRITICAL_REGION_ENTER();
    ret_val = manual_op_req;
    CRITICAL_REGION_EXIT();
    return ret_val;
}

void manualop_act_done(void)
{
    CRITICAL_REGION_ENTER();
    manual_op_req = false;
    CRITICAL_REGION_EXIT();
}

void exec_ble_unlock_cmd_reques(void)
{
    CRITICAL_REGION_ENTER();
    if (!exec_ble_unlock_cmd_req)
    {
      exec_ble_unlock_cmd_req = true;
    }
    CRITICAL_REGION_EXIT();
}

bool need_to_exec_ble_unlock_cmd(void)
{
    bool ret_val = true;
    CRITICAL_REGION_ENTER();
    ret_val = exec_ble_unlock_cmd_req;
    CRITICAL_REGION_EXIT();
    return ret_val;
}

void exec_ble_unlock_cmd_done(void)
{
    CRITICAL_REGION_ENTER();
    exec_ble_unlock_cmd_req = false;
    CRITICAL_REGION_EXIT();
}

void press_release_act_request(void)
{   
#define MAX_ACT_IN_QUEUE 2
    uint16_t diff;
  
    CRITICAL_REGION_ENTER();
    diff = (actseq_req + 256 - actseq_done) & 0xff;
    if (diff < MAX_ACT_IN_QUEUE)
    {
        actseq_req = (actseq_req + 1) & 0xff;
    }
    CRITICAL_REGION_EXIT();
}

bool need_to_press_release_act(void)
{
    bool ret_val = true;
    CRITICAL_REGION_ENTER();
    if (actseq_req == actseq_done)
    {
        ret_val = false;
    }
    CRITICAL_REGION_EXIT();
    return ret_val;
}

void press_release_act_done(void)
{
    CRITICAL_REGION_ENTER();
    actseq_done = (actseq_done + 1) & 0xff;
    CRITICAL_REGION_EXIT();
}

void batt_adc_update_request(void)
{   

    CRITICAL_REGION_ENTER();
    batt_adc_update_req = true;
    CRITICAL_REGION_EXIT();
}

bool need_to_batt_adc_update(void)
{   
    bool ret_val = true;
    CRITICAL_REGION_ENTER();
    ret_val = batt_adc_update_req;
    CRITICAL_REGION_EXIT();
    return ret_val;
}

void batt_adc_update_done(void)
{
    CRITICAL_REGION_ENTER();
    batt_adc_update_req = false;
    CRITICAL_REGION_EXIT();
}

void ss2_wakeup_state_machine(void * p_event_data, uint16_t event_size)
{
    ret_code_t err_code;
    
    if (actseq_exec == true) return;

    actseq_exec = true;
    err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
    APP_ERROR_CHECK(err_code);
}

ret_code_t ss2sw_press_release(uint8_t preset)
{

    switch (preset)
    {
     case SS2SW_PRESET_UNLOCK:
        exec_ble_unlock_cmd_reques();
        app_sched_event_put(NULL, 0,ss2_wakeup_state_machine);
        break;
    case SS2SW_PRESET_LOCK:
    default:
        return NRF_ERROR_INVALID_PARAM;
    }

    return NRF_SUCCESS;
}

ret_code_t ss2sw_arm_positioning(void)
{

    positioning_act_request();
    app_sched_event_put(NULL, 0,ss2_wakeup_state_machine);
    return NRF_SUCCESS;
}

void mdrv_motor_coast(void)
{
	nrf_gpio_pin_clear(DRV_nSLEEP_PIN);
	nrf_gpio_pin_clear(DRV_PH_PIN);
	nrf_gpio_pin_clear(DRV_EN_PIN);
}	

void mdrv_motor_brake(void)
{
	nrf_gpio_pin_clear(DRV_EN_PIN);
	nrf_gpio_pin_set(DRV_nSLEEP_PIN);
}	

void mdrv_motor_reverse(void)
{
	nrf_gpio_pin_set(DRV_PH_PIN);
	nrf_gpio_pin_set(DRV_nSLEEP_PIN);
	nrf_gpio_pin_set(DRV_EN_PIN);
}

void mdrv_motor_forward(void)
{
	nrf_gpio_pin_clear(DRV_PH_PIN);
	nrf_gpio_pin_set(DRV_nSLEEP_PIN);
	nrf_gpio_pin_set(DRV_EN_PIN);
}

static void drv_gpio(MOTOR_FUN_TYPE_ motor_act)
{
	if (motor_act == COAST_)
	{
		mdrv_motor_coast();
	}
	else if (motor_act == BRAKE_)
	{
		mdrv_motor_brake();
	}	
	else if (motor_act == FORWARD_)
	{
		mdrv_motor_forward();
	}		
	else if (motor_act == REVERSE_)
	{
		mdrv_motor_reverse();
	}		
}	

static void copy_to_cur_act_seq(motor_single_act *extern_act_seq)
{
    for(uint16_t idx=0; idx<MAX_ACTS_SEQCMD; ++idx)
    {
        cur_act_seq[idx] = extern_act_seq[idx];
    }	
}

static void prepare_cur_act_seq_from_mechs()
{
    cur_act_seq[0].motor_act = FORWARD_;
    cur_act_seq[0].interval  = conf.unlock_drvieF_time * 100;
    cur_act_seq[1].motor_act = BRAKE_;
    cur_act_seq[1].interval  = conf.unlock_drvieH_time * 100;
    cur_act_seq[2].motor_act = REVERSE_;
    cur_act_seq[2].interval  = conf.unlock_drvieB_time * 100;
    cur_act_seq[3].motor_act = COAST_;
    cur_act_seq[3].interval  = 0;
    cur_act_seq[4].motor_act = END_ACT_SEQ_;
    cur_act_seq[4].interval  = 0;
}

static void stateM_timeout_handler(void * p_context)
{
    uint32_t	err_code;
	
    if (break_cmd_req != break_cmd_done)
    {
        return;
    }

    if (actseq_state == ACTSEQ_INIT_)
    {
        idx_cur_act_seq = 0;
        cur_exec_loop_done = 0;
        cur_exec_iteration_done = 0;
        cur_exec_iteration_max =0;
        copy_to_cur_act_seq(poweron_motor_init_seq);
        cur_act_type = poweron_motor_init_seq;
        
        actseq_state = ACTSEQ_EXEC_;
        event.history_type = SS2SW_HISTORY_TYPE_NONE;
        event.mech_status.battery = battery.adc;
        event.mech_status.is_motor_moving = true;
        EVENT_HANDLER(&event); 	

        err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
	APP_ERROR_CHECK(err_code);
        return;
    }
    else if (actseq_state == ACTSEQ_EXEC_)
    {
        while(1)
        {
          if (cur_act_seq[idx_cur_act_seq].motor_act == END_ACT_SEQ_)
          {
              ++ cur_exec_iteration_done;
              if (cur_exec_iteration_done >= cur_exec_iteration_max)
              {
                  if (cur_act_type == arm_positioning_release_seq)
                  {
                      positioning_act_done();
                      //event.history_type = SS2SW_HISTORY_TYPE_DRIVE_POSITIONING;
                      event.mech_status.battery = battery.adc;

                      event.mech_status.is_critical = true;
                      //event.mech_status.position = 0; 
                      //event.mech_status.target = 0;
                      event.mech_status.is_motor_moving = false;
                      event.mech_status.ret_code =  1;
                      EVENT_HANDLER(&event);
                  }
                  else if (cur_act_type == &conf.unlock_drvieF_time)
                  {
                      exec_ble_unlock_cmd_done();  
                      event.history_type = SS2SW_HISTORY_TYPE_DRIVE_UNLOCKED;
                      event.mech_status.battery = battery.adc;

                      //event.mech_status.in_unlock_range = true;
                      event.mech_status.is_critical = true;
                      //event.mech_status.position = 0; 
                      //event.mech_status.target = 0;
                      event.mech_status.is_motor_moving = false;
                      EVENT_HANDLER(&event);
                  }
                  else if (cur_act_type == poweron_motor_init_seq)
                  {
                      event.history_type = SS2SW_HISTORY_TYPE_NONE;
                      event.mech_status.battery = battery.adc;

                      //event.mech_status.in_unlock_range = true;
                      event.mech_status.is_critical = true;
                      event.mech_status.is_motor_moving = false;
                      EVENT_HANDLER(&event);
                  }
                  else 
                  {
                      if (manual_operation) 
                      {
                        manual_operation = false;
                        manualop_act_done();
                        event.history_type = SS2SW_HISTORY_TYPE_MANUAL_UNLOCKED;
                        event.mech_status.battery = battery.adc;

                        //event.mech_status.in_unlock_range = true;
                        event.mech_status.is_critical = true;
                        //event.mech_status.position = 0; 
                        //event.mech_status.target = 0;
                        event.mech_status.is_motor_moving = false;
                        EVENT_HANDLER(&event);
                      }
                      else
                      {
                        press_release_act_done();  
                        event.history_type = SS2SW_HISTORY_TYPE_DRIVE_UNLOCKED;
                        event.mech_status.battery = battery.adc;

                        //event.mech_status.in_unlock_range = true;
                        event.mech_status.is_critical = true;
                        //event.mech_status.position = 0; 
                        //event.mech_status.target = 0;
                        event.mech_status.is_motor_moving = false;
                        EVENT_HANDLER(&event);
                      }
                  }    
                  actseq_state = ACTSEQ_GET_NEW_ACTSEQ_;
                  err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
                  APP_ERROR_CHECK(err_code);
                  return;
              }
              else
              {
                  cur_exec_loop_done = 0;
                  idx_cur_act_seq = 0;
              }	
          }
          else if (cur_act_seq[idx_cur_act_seq].motor_act == LOOP_)
          {
              ++ cur_exec_loop_done;
              if (cur_exec_loop_done >= cur_act_seq[idx_cur_act_seq].interval)
              {
                  ++idx_cur_act_seq;
              }
              else
              {
                  idx_cur_act_seq = 0;
              }	
          }			
	
          if ((cur_act_seq[idx_cur_act_seq].motor_act == COAST_) || 
              (cur_act_seq[idx_cur_act_seq].motor_act == BRAKE_) ||
              (cur_act_seq[idx_cur_act_seq].motor_act == FORWARD_) ||
              (cur_act_seq[idx_cur_act_seq].motor_act == REVERSE_))
          {
              drv_gpio(cur_act_seq[idx_cur_act_seq].motor_act);
          }
          else
          {
              if (cur_act_type == arm_positioning_release_seq)
                positioning_act_done();
              else 
                press_release_act_done();

              actseq_state = ACTSEQ_GET_NEW_ACTSEQ_;
              err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
              APP_ERROR_CHECK(err_code);
              return;
          }

		
          if (cur_act_seq[idx_cur_act_seq].interval != 0)
          {	
              err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(cur_act_seq[idx_cur_act_seq].interval), NULL);
              APP_ERROR_CHECK(err_code);

              event.history_type = SS2SW_HISTORY_TYPE_NONE;
              event.mech_status.battery = battery.adc;

              EVENT_HANDLER(&event);

