aa8764114/nRF5_SDK_15.3.0_59ac345/components/ssm_boards/ss2sw.c
              ++idx_cur_act_seq;
              return;
          }
          ++idx_cur_act_seq;
        }
    }
    else if (actseq_state == ACTSEQ_GET_NEW_ACTSEQ_)
    {
        if (need_to_batt_adc_update())
        {
            batt_adc_update_done();
            event.mech_status.battery = battery.adc;
            event.history_type = SS2SW_HISTORY_TYPE_NONE;
            EVENT_HANDLER(&event);
        }

        if (need_to_positioning_act())
        {
            idx_cur_act_seq = 0;
            cur_exec_loop_done = 0;
            cur_exec_iteration_done = 0;
            cur_exec_iteration_max =0;
            copy_to_cur_act_seq(arm_positioning_release_seq);
            cur_act_type = arm_positioning_release_seq;

        
            actseq_state = ACTSEQ_EXEC_;
            event.history_type = SS2SW_HISTORY_TYPE_NONE;
            event.mech_status.battery = battery.adc;
            event.mech_status.is_motor_moving = true;
            EVENT_HANDLER(&event);

            err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
            APP_ERROR_CHECK(err_code);
            return;        
        }
        else if (need_to_manualop_act())
        {
            idx_cur_act_seq = 0;
            cur_exec_loop_done = 0;
            cur_exec_iteration_done = 0;
            cur_exec_iteration_max =0;
            copy_to_cur_act_seq(standard_press_release_seq);
            cur_act_type = standard_press_release_seq;

            manual_operation = true;
       
            actseq_state = ACTSEQ_EXEC_;
            event.history_type = SS2SW_HISTORY_TYPE_NONE;
            event.mech_status.battery = battery.adc;
            event.mech_status.is_motor_moving = true;
            EVENT_HANDLER(&event); 	

            err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
            APP_ERROR_CHECK(err_code);
            return;
        }
        else if (need_to_exec_ble_unlock_cmd())
        { 
            idx_cur_act_seq = 0;
            cur_exec_loop_done = 0;
            cur_exec_iteration_done = 0;
            cur_exec_iteration_max =0;
            prepare_cur_act_seq_from_mechs();
            cur_act_type = &conf.unlock_drvieF_time;

        
            actseq_state = ACTSEQ_EXEC_;
            event.history_type = SS2SW_HISTORY_TYPE_NONE;
            event.mech_status.battery = battery.adc;
            event.mech_status.is_motor_moving = true;
            EVENT_HANDLER(&event); 	
            
            err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
            APP_ERROR_CHECK(err_code);
            return;
        }
        else if (need_to_press_release_act())
        { 
            idx_cur_act_seq = 0;
            cur_exec_loop_done = 0;
            cur_exec_iteration_done = 0;
            cur_exec_iteration_max =0;
            copy_to_cur_act_seq(standard_press_release_seq);
            cur_act_type = standard_press_release_seq;

        
            actseq_state = ACTSEQ_EXEC_;
            event.history_type = SS2SW_HISTORY_TYPE_NONE;
            event.mech_status.battery = battery.adc;
            event.mech_status.is_motor_moving = true;
            EVENT_HANDLER(&event); 	
            
            err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
            APP_ERROR_CHECK(err_code);
            return;
        }
        else
        {
            actseq_exec = false;
        }
   }
}	

static void calib_timer_handler(void * p_context)
{
    if (actseq_exec == false)
    {
        int32_t temperature, diff;

        sd_temp_get(&temperature);
        diff = temperature - calib.last_calibration_temperature;
        if (ABS(diff) > CALIB_TEMPERATURE_CRITIRIA)
        {
            calib.last_calibration_temperature = temperature;
            CRITICAL_REGION_ENTER();
            need_calibrate = true;
            CRITICAL_REGION_EXIT();
        }
        NRF_LOG_DEBUG("[%s] temperature=%d.%d (last:%d.%d)", __func__, temperature/4, (temperature&3)*25, calib.last_calibration_temperature/4, (calib.last_calibration_temperature&3)*25);
    }
    else
    {
        NRF_LOG_DEBUG("[%s] actseq_exec=%d, skipped", __func__, actseq_exec);
    }
}

static void msw_gpio_polling_state_handler(void * p_context)
{    
    ret_code_t err_code;
    bool msw_gpio_ret;

    nrf_gpio_cfg_input(GPIO_MICRO_SWITCH_SENSOR, NRF_GPIO_PIN_PULLUP);
    nrf_delay_us(20);
    //while (nrf_gpio_pin_input_get(GPIO_MICRO_SWITCH_SENSOR) != NRF_GPIO_PIN_INPUT_CONNECT);
    //while (nrf_gpio_pin_pull_get(GPIO_MICRO_SWITCH_SENSOR) != NRF_GPIO_PIN_PULLUP);

    msw_gpio_ret = (bool) nrf_gpio_pin_read(GPIO_MICRO_SWITCH_SENSOR);
    nrf_gpio_cfg_default(GPIO_MICRO_SWITCH_SENSOR);

    if (msw_gpio_polling_state == STABLE_MSW_GPIO_DETECT_)
    {
        if (msw_gpio_ret != msw_gpio_stable)
        {
            msw_gpio_polling_state = DEBOUNCING_MSW_GPIO_DETECT_;
            msw_gpio_debounce = msw_gpio_ret;
            msw_gpio_nochg_dur_debounce = 0;
            msw_gpio_polling_interval = POLLING_INTERVAL_DEBOUNCE;
        }
        else
        {
            msw_gpio_polling_interval = POLLING_INTERVAL_STABLE;
        }
    }
    else if (msw_gpio_polling_state == DEBOUNCING_MSW_GPIO_DETECT_)
    {   
        if (msw_gpio_ret != msw_gpio_debounce)
        {
            msw_gpio_debounce = msw_gpio_ret;
            msw_gpio_nochg_dur_debounce = 0;
            msw_gpio_polling_interval = POLLING_INTERVAL_DEBOUNCE;
        }
        else
        {
            msw_gpio_nochg_dur_debounce += msw_gpio_polling_interval;
            if (msw_gpio_nochg_dur_debounce >= MSW_GPIO_DEBOUNCE_TIME)
            {
                msw_gpio_polling_state = STABLE_MSW_GPIO_DETECT_;
                msw_gpio_polling_interval = POLLING_INTERVAL_STABLE; 

                if (msw_gpio_stable != msw_gpio_debounce)
                {
                    msw_gpio_stable = msw_gpio_debounce;

                    if (msw_gpio_stable)
                    {
                        event.history_type = SS2SW_HISTORY_TYPE_MANUAL_LOCKED;
                        event.mech_status.is_locked = true;
                        event.mech_status.is_unlocked = false;
                        EVENT_HANDLER(&event);
                    }
                    else 
                    {
                        if (!need_to_exec_ble_unlock_cmd())
                        {
                            event.history_type = SS2SW_HISTORY_TYPE_MANUAL_UNLOCKED;
                            event.mech_status.is_locked = false;
                            event.mech_status.is_unlocked = true;
                            EVENT_HANDLER(&event);
                        }
                        else
                        {
                            event.history_type = SS2SW_HISTORY_TYPE_NONE;
                            event.mech_status.is_locked = false;
                            event.mech_status.is_unlocked = true;
                            EVENT_HANDLER(&event);
                        }
                    }
                }
            }
            else
            {
                msw_gpio_polling_interval = POLLING_INTERVAL_DEBOUNCE;
            }
        }
    }
    else if (msw_gpio_polling_state == INTI_MSW_GPIO_DETECT_)
    {
        msw_gpio_stable = msw_gpio_ret;
        msw_gpio_polling_state = STABLE_MSW_GPIO_DETECT_;
        msw_gpio_polling_interval = POLLING_INTERVAL_10MS_START;

        //switch_sensor_update_request();
        //app_sched_event_put(NULL, 0,ss2_wakeup_state_machine);
        if (msw_gpio_stable)
        {
          event.history_type = SS2SW_HISTORY_TYPE_NONE;
          event.mech_status.is_locked = true;
          event.mech_status.is_unlocked = false;
        }
        else
        {
          event.history_type = SS2SW_HISTORY_TYPE_NONE;
          event.mech_status.is_locked = false;
          event.mech_status.is_unlocked = true;
        }
        EVENT_HANDLER(&event);
    }    
    else
    {
    }

    err_code = app_timer_start(msw_gpio_polling_state_timer, APP_TIMER_TICKS(msw_gpio_polling_interval), NULL);
    APP_ERROR_CHECK(err_code);   
}

static void init_gpio(void)
{
    nrf_gpio_cfg_output(DRV_nSLEEP_PIN);
    nrf_gpio_cfg_output(DRV_PH_PIN);
    nrf_gpio_cfg_output(DRV_EN_PIN);

    nrf_gpio_cfg_default(GPIO_MICRO_SWITCH_SENSOR);

    mdrv_motor_coast();
}

