aa8764114/nRF5_SDK_15.3.0_59ac345/components/ssm_boards/ss2sw.c
static void init_rtc(void)
{
    uint32_t rtc_ms;

    nrf_rtc_prescaler_set(RTC_REG, RTC_PRESCALER);
    NRFX_IRQ_DISABLE(RTC_IRQ);
    rtc_ms = THREE_MINUTE_RTC_MS;
    nrf_rtc_cc_set(RTC_REG, 0, rtc_ms);
    nrf_rtc_event_enable(RTC_REG, RTC_EVTEN_COMPARE0_Msk);
}

static void init_ppi(void)
{
    ret_code_t err_code;

    err_code = nrfx_ppi_channel_alloc(&ppi_ch_on_rtc_adc);
    APP_ERROR_CHECK(err_code);
    err_code = nrfx_ppi_channel_assign(ppi_ch_on_rtc_adc, (uint32_t)&RTC_REG->EVENTS_COMPARE[0], (uint32_t)&RTC_REG->TASKS_CLEAR);
    APP_ERROR_CHECK(err_code);
    err_code = nrfx_ppi_channel_fork_assign(ppi_ch_on_rtc_adc, (uint32_t)&NRF_SAADC->TASKS_START);
    APP_ERROR_CHECK(err_code);

    err_code = nrfx_ppi_channel_alloc(&ppi_ch_on_adc_calib);
    APP_ERROR_CHECK(err_code);
    err_code = nrfx_ppi_channel_assign(ppi_ch_on_adc_calib, (uint32_t)&NRF_SAADC->EVENTS_CALIBRATEDONE, (uint32_t)&NRF_SAADC->TASKS_STOP);
    APP_ERROR_CHECK(err_code);
}

static void init_saadc(void)
{
    const nrf_saadc_channel_config_t conf = {
            .resistor_p = NRF_SAADC_RESISTOR_DISABLED,      \
            .resistor_n = NRF_SAADC_RESISTOR_DISABLED,      \
            .gain       = NRF_SAADC_GAIN1_6,                \
            .reference  = NRF_SAADC_REFERENCE_INTERNAL,     \
            .acq_time   = NRF_SAADC_ACQTIME_20US,           \
            .mode       = NRF_SAADC_MODE_SINGLE_ENDED,      \
            .burst      = NRF_SAADC_BURST_DISABLED,         \
            .pin_p      = NRF_SAADC_INPUT_VDD,       \
            .pin_n      = NRF_SAADC_INPUT_DISABLED
    };

    memset(saadc_buffer, 0, sizeof(saadc_buffer));

    nrf_saadc_resolution_set(NRF_SAADC_RESOLUTION_10BIT);
    nrf_saadc_oversample_set(NRF_SAADC_OVERSAMPLE_DISABLED);
    nrf_saadc_int_disable(NRF_SAADC_INT_ALL);
    nrf_saadc_event_clear(NRF_SAADC_EVENT_END);
    nrf_saadc_event_clear(NRF_SAADC_EVENT_STARTED);
    nrf_saadc_event_clear(NRF_SAADC_EVENT_STOPPED);
    NRFX_IRQ_PRIORITY_SET(SAADC_IRQn, SAADC_INT_PRIORITY);
    NRFX_IRQ_ENABLE(SAADC_IRQn);
    nrf_saadc_int_enable(NRF_SAADC_INT_STARTED | NRF_SAADC_INT_END);

    nrf_saadc_enable();

    nrf_saadc_channel_init(SAADC_CHANNEL_BATTERY, &conf);
    nrf_saadc_buffer_init(saadc_buffer, 1);
}

void ss2sw_init(ss2sw_init_t const * init)
{
    ret_code_t err_code;

    memset(&calib, 0, sizeof(calib));
    memset(&battery, 0, sizeof(battery));
    battery.adc = 5 * 1024 / 6;
        
    err_code = app_timer_create(&act_seq_timer_id,APP_TIMER_MODE_SINGLE_SHOT,stateM_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&calib_timer, APP_TIMER_MODE_REPEATED, calib_timer_handler);
    APP_ERROR_CHECK(err_code);

    //err_code = app_timer_create(&mswitch_debounce_timer, APP_TIMER_MODE_SINGLE_SHOT, mswitch_gpio_change_handler);
    //APP_ERROR_CHECK(err_code);
    err_code = app_timer_create(&msw_gpio_polling_state_timer, APP_TIMER_MODE_SINGLE_SHOT, msw_gpio_polling_state_handler);
    APP_ERROR_CHECK(err_code);

    is_configured = false;
    need_calibrate = true;

    conf = sw_mech_setting_default;

    init_gpio();
    init_rtc();
    init_ppi();
    init_saadc();

    err_code = nrfx_ppi_channel_enable(ppi_ch_on_rtc_adc);
    APP_ERROR_CHECK(err_code);
    err_code = nrfx_ppi_channel_enable(ppi_ch_on_adc_calib);
    APP_ERROR_CHECK(err_code);
}

void ss2sw_start(void)
{
    ret_code_t err_code;

    nrf_saadc_task_trigger(NRF_SAADC_TASK_START);
    nrf_rtc_task_trigger(RTC_REG, NRF_RTC_TASK_START);
    nrf_delay_ms(100);

    err_code = app_timer_start(calib_timer, APP_TIMER_TICKS(CALIB_INTERVAL_MS), NULL);
    APP_ERROR_CHECK(err_code);
    
    if (actseq_exec == true) return;

    actseq_exec = true;
    err_code = app_timer_start(act_seq_timer_id, APP_TIMER_TICKS(ACTSEQ_STATE_SWITCH_100_MS), NULL);
    APP_ERROR_CHECK(err_code);

    //micro_switch_sensor_start();
    //start micro switch gpio polling state machine
    err_code = app_timer_start(msw_gpio_polling_state_timer, APP_TIMER_TICKS(POLLING_INTERVAL_10MS_START), NULL);
    APP_ERROR_CHECK(err_code);   

    //switch_sensor_update_request();
    //app_sched_event_put(NULL, 0,ss2_wakeup_state_machine);
}

ss2sw_conf_t* ss2sw_get_mech_setting(void)
{
    return &conf;
}

ret_code_t ss2sw_update_mech_setting(ss2sw_conf_t const * new_conf)
{
    conf = *new_conf;
    NRF_LOG_INFO("unlock_drvieF_time=%d, unlock_drvieH_time=%d, unlock_drvieB_time", conf.unlock_drvieF_time, conf.unlock_drvieH_time, conf.unlock_drvieB_time);
    if (!is_configured)
    {
        is_configured = true;
        //range_detect_init(position_calc.last_position);
    }
    return NRF_SUCCESS;
}

static void on_adc_battery(int16_t battery_adc)
{
    if (battery_adc < battery.adc - BATTERY_ADC_NOISE)
    {
        battery.adc = battery_adc + BATTERY_ADC_NOISE;
    }
    else if (battery_adc > battery.adc + BATTERY_ADC_NOISE)
    {
        battery.adc = battery_adc - BATTERY_ADC_NOISE;
    }
    else
    {
        battery.adc = (battery.adc + battery_adc) / 2;
    }
    NRF_LOG_DEBUG("[%s] battery_adc=%d, battery.adc=%d", __func__, battery_adc, battery.adc);
}

void SAADC_IRQHandler(void)
{
    uint32_t rtc_ms;

    if (nrf_saadc_event_check(NRF_SAADC_EVENT_STARTED))
    {
        nrf_saadc_event_clear(NRF_SAADC_EVENT_STARTED);     // w/o EDS3202 this is enough
        nrf_saadc_task_trigger(NRF_SAADC_TASK_SAMPLE);
        nrf_saadc_event_clear(NRF_SAADC_EVENT_END);
    }
    else if (nrf_saadc_event_check(NRF_SAADC_EVENT_END))
    {
        nrf_saadc_event_clear(NRF_SAADC_EVENT_END);
        
        if (actseq_exec == false)
        {
            on_adc_battery(saadc_buffer[0]);
            batt_adc_update_request();
            app_sched_event_put(NULL, 0,ss2_wakeup_state_machine);
        }
 
        if (need_calibrate)
        {
            NRF_LOG_DEBUG("[%s] SAADC triggered calibrate", __func__);
            nrf_saadc_task_trigger(NRF_SAADC_TASK_CALIBRATEOFFSET);
            need_calibrate = false;
        }
        else
        {
            nrf_saadc_task_trigger(NRF_SAADC_TASK_STOP);
        }
    }

    rtc_ms = THREE_MINUTE_RTC_MS;
    nrf_rtc_cc_set(RTC_REG, 0, rtc_ms);
}
